backend/app/controllers/api/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
    def index
      transactions = Transaction.all